IDEA StatiCa Open Model
InitialImperfectionOfPoint.Displacement Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Displacement of structure point
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Vector3D Displacement { get; set; }
Public Property Displacement As Vector3D
	Get
	Set
public:
property Vector3D^ Displacement {
	Vector3D^ get ();
	void set (Vector3D^ value);
}
Property Value
Type: Vector3D
See Also
Reference
InitialImperfectionOfPoint Class
IdeaRS.OpenModel.Model Namespace